#!/usr/bin/python
# -*- coding=utf-8 -*-
"""
Constants used for number module
"""
from __future__ import unicode_literals    # at top of module

THAOUSAND_MULTIPLE = ()
NUMBER_TEN_MASCULIN_UNITS = (
    u'اثني',
    u'اثنا',
    u'اثني',
    u'اثنا',
    u'احد',
    u'ثلاثه',
    u'اربعه',
    u'خمسه',
    u'سته',
    u'سبعه',
    u'ثمانيه',
    u'تسعه',
)
NUMBER_TEN_FEMININ_UNITS = (
    u'احدى',
    u'اثنتا',
    u'اثنتي',
    u'ثلاث',
    u'اربع',
    u'خمس',
    u'ست',
    u'سبع',
    u'ثمان',
    u'ثماني',
    u'تسع',
)
NUMBER_WORDS = {
    u'صفر':0,
    u'واحد':1,
    u'واحده':1,
    u'اثنان':2,
    u'ثلاثه':3,
    u'اربعه':4,
    u'خمسه':5,
    u'سته':6,
    u'سبعه':7,
    u'ثمانيه':8,
    u'تسعه':9,
    u'عشره':10,
    u'عشرون':20,
    u'ثلاثون':30,
    u'اربعون':40,
    u'خمسون':50,
    u'ستون':60,
    u'سبعون':70,
    u'ثمانون':80,
    u'تسعون':90,
    u'مئه':100,
    u'مئتان':200,
    u'ثلاثمئه':300,
    u'اربعمئه':400,
    u'خمسمئه':500,
    u'ستمئه':600,
    u'سبعمئه':700,
    u'ثمانمئه':800,
    u'تسعمئه':900,

    u'ثلاثمائه':300,
    u'اربعمائه':400,
    u'خمسمائه':500,
    u'ستمائه':600,
    u'سبعمائه':700,
    u'ثمانمائه':800,
    u'تسعمائه':900,

    u'الف':1000,
    u'الفا':1000,

    u'مليون':1000000,
    u'مليار':1000000000,

    u'الفان':2000,
    u'الفين':2000,

    u'مليونان':2000000,
    u'مليونين':2000000,

    u'ملياران':2000000000,
    u'مليارين':2000000000,

    u'احد':1,
    u'احدى':1,

    u'اثنين':2,
    u'اثنين':2,
    u'اثنان':2,

    u'اثني':2,
    u'اثنا':2,
    u'اثني':2,
    u'اثنا':2,
    u'ثلاث':3,
    u'اربع':4,
    u'خمس':5,
    u'ست':6,
    u'سبع':7,
    u'ثمان':8,
    u'ثماني':8,
    u'تسع':9,
    u'عشر':10,
    u'ثلاثا':3,
    u'اربعا':4,
    u'خمسا':5,
    u'ستا':6,
    u'سبعا':7,
    u'تسعا':9,
    u'عشرا':10,


    u'عشرين':20,
    u'ثلاثين':30,
    u'اربعين':40,
    u'خمسين':50,
    u'ستين':60,
    u'سبعين':70,
    u'ثمانين':80,
    u'تسعين':90,
    u'مائه':100,
    u'مئتين':200,
    u'الاف':1000,
    u'ملايين':1000000,
    u'مليارات':1000000000,
}

VOCALIZED_NUMBER_WORDS = {
    #i: unvocalized
    #r ; marafou3 رفع
    #r2 : marfou3 + tanwin
    #n : mansoub
    #n2: mansoub + tanwin
    #j : majrour
    #j2 : majrour + tanwin
    u'صفر':{u'i':u'صِفْر', u'r':u'صِفْرُ', u'r2':u'صِفْرٌ', u'n':u'صِفْرَ',
            u'n2':u'صِفْرً', u'j':u'صِفْرِ', u'j2':u'صِفْرٍ', u's':u''},
    u'واحد':{u'i':u'وَاحِد', u'r':u'وَاحِدُ', u'r2':u'وَاحِدٌ', u'n':u'وَاحِدَ',
             u'n2':u'وَاحِدً', u'j':u'وَاحِدِ', u'j2':u'وَاحِدٍ', u's':u''},
    u'واحده':{u'i':u'وَاحِدَه', u'r':u'وَاحِدَهُ', u'r2':u'وَاحِدَهٌ',
              u'n':u'وَاحِدَهَ', u'n2':u'وَاحِدَهً', u'j':u'وَاحِدَهِ', u'j2':u'وَاحِدَهٍ',
              u's':u''},
    u'اثنان':{u'i':u'اثنان', u'r':u'اثنان', u'r2':u'اثنانٌ',
              u'n':u'اثنانَ', u'n2':u'اثنانً', u'j':u'اثنانِ', u'j2':u'اثنانٍ',
              u's':u'*'},
    u'ثلاثه':{u'i':u'ثَلاثَه', u'r':u'ثَلاثَهُ', u'r2':u'ثَلاثَهٌ', u'n':u'ثَلاثَهَ',
              u'n2':u'ثَلاثَهً', u'j':u'ثَلاثَهِ', u'j2':u'ثَلاثَهٍ', u's':u''},
    u'اربعه':{u'i':u'اَرْبَعَه', u'r':u'اَرْبَعَهُ', u'r2':u'اَرْبَعَهٌ',
              u'n':u'اَرْبَعَهَ', u'n2':u'اَرْبَعَهً', u'j':u'اَرْبَعَهِ', u'j2':u'اَرْبَعَهٍ',
              u's':u''},
    u'خمسه':{u'i':u'خَمْسَه', u'r':u'خَمْسَهُ', u'r2':u'خَمْسَهٌ', u'n':u'خَمْسَهَ',
             u'n2':u'خَمْسَهً', u'j':u'خَمْسَهِ', u'j2':u'خَمْسَهٍ', u's':u''},
    u'سته':{u'i':u'سِتَّه', u'r':u'سِتَّهُ', u'r2':u'سِتَّهٌ', u'n':u'سِتَّهَ',
            u'n2':u'سِتَّهً', u'j':u'سِتَّهِ', u'j2':u'سِتَّهٍ', u's':u''},
    u'سبعه':{u'i':u'سَبْعَه', u'r':u'سَبْعَهُ', u'r2':u'سَبْعَهٌ', u'n':u'سَبْعَهَ',
             u'n2':u'سَبْعَهً', u'j':u'سَبْعَهِ', u'j2':u'سَبْعَهٍ', u's':u''},
    u'ثمانيه':{u'i':u'ثَمانِيَه', u'r':u'ثَمانِيَهُ', u'r2':u'ثَمانِيَهٌ',
               u'n':u'ثَمانِيَهَ', u'n2':u'ثَمانِيَهً', u'j':u'ثَمانِيَهِ',
               u'j2':u'ثَمانِيَهٍ', u's':u''},
    u'تسعه':{u'i':u'تِسْعَه', u'r':u'تِسْعَهُ', u'r2':u'تِسْعَهٌ', u'n':u'تِسْعَهَ',
             u'n2':u'تِسْعَهً', u'j':u'تِسْعَهِ', u'j2':u'تِسْعَهٍ', u's':u''},
    u'عشره':{u'i':u'عَشْرَه', u'r':u'عَشْرَهُ', u'r2':u'عَشْرَهٌ', u'n':u'عَشْرَهَ',
             u'n2':u'عَشْرَهً', u'j':u'عَشْرَهِ', u'j2':u'عَشْرَهٍ', u's':u''},
    u'عشرون':{u'i':u'عِشْرُونَ', u'r':u'عِشْرُونَ', u'r2':u'', u'n':u'',
              u'n2':u'', u'j':u'', u'j2':u'', u's':u'*'},
    u'ثلاثون':{u'i':u'ثَلاثُونَ', u'r':u'ثَلاثُونَ', u'r2':u'', u'n':u'',
               u'n2':u'', u'j':u'', u'j2':u'', u's':u'*'},
    u'اربعون':{u'i':u'اَرْبَعُونَ', u'r':u'اَرْبَعُونَ', u'r2':u'', u'n':u'',
               u'n2':u'', u'j':u'', u'j2':u'', u's':u'*'},
    u'خمسون':{u'i':u'خَمْسُونَ', u'r':u'خَمْسُونَ', u'r2':u'', u'n':u'',
              u'n2':u'', u'j':u'', u'j2':u'', u's':u'*'},
    u'ستون':{u'i':u'سِتُّونَ', u'r':u'سِتُّونَ', u'r2':u'', u'n':u'',
             u'n2':u'', u'j':u'', u'j2':u'', u's':u'*'},
    u'سبعون':{u'i':u'سَبْعُونَ', u'r':u'سَبْعُونَ', u'r2':u'', u'n':u'',
              u'n2':u'', u'j':u'', u'j2':u'', u's':u'*'},
    u'ثمانون':{u'i':u'ثمانون', u'r':u'ثمانون', u'r2':u'', u'n':u'',
               u'n2':u'', u'j':u'', u'j2':u'', u's':u'*'},
    u'تسعون':{u'i':u'تِسْعُونَ', u'r':u'تِسْعُونَ', u'r2':u'', u'n':u'',
              u'n2':u'', u'j':u'', u'j2':u'', u's':u'*'},
    u'مئه':{u'i':u'مِئَه', u'r':u'مِئِهُ', u'r2':u'مِئَهٌ', u'n':u'مِئَهَ',
            u'n2':u'مِئَهً', u'j':u'مِئَهِ', u'j2':u'مِئَهٍ', u's':u''},
    u'مئتان':{u'i':u'مِئَتَانِ', u'r':u'مِئَتَانِ', u'r2':u'', u'n':u'',
              u'n2':u'', u'j':u'', u'j2':u'', u's':u'*'},
    u'ثلاثمئه':{u'i':u'ثَلَاثمِئَه', u'r':u'ثَلَاثُمِئَهِ', u'r2':u'ثَلَاثُمِئَهٍ',
                u'n':u'ثَلَاثَمِئَهِ', u'n2':u'ثَلَاثَمِئَهٍ', u'j':u'ثَلَاثِمِئَهِ',
                u'j2':u'ثَلَاثِمِئَهٍ', u's':u''},
    u'اربعمئه':{u'i':u'اَرْبَعمِئَه', u'r':u'اَرْبَعُمِئَهِ', u'r2':u'اَرْبَعُمِئَهٍ',
                u'n':u'اَرْبَعَمِئَهِ', u'n2':u'اَرْبَعَمِئَهٍ', u'j':u'اَرْبَعِمِئَهِ',
                u'j2':u'اَرْبَعِمِئَهٍ', u's':u''},
    u'خمسمئه':{u'i':u'خَمْسمِئَه', u'r':u'خَمْسُمِئَهِ', u'r2':u'خَمْسُمِئَهٍ',
               u'n':u'خَمْسَمِئَهِ', u'n2':u'خَمْسَمِئَهٍ', u'j':u'خَمْسِمِئَهِ',
               u'j2':u'خَمْسِمِئَهٍ', u's':u''},
    u'ستمئه':{u'i':u'سِتّمِئَه', u'r':u'سِتُّمِئَهِ', u'r2':u'سِتُّمِئَهٍ',
              u'n':u'سِتَّمِئَهِ', u'n2':u'سِتَّمِئَهٍ', u'j':u'سِتِّمِئَهِ',
              u'j2':u'سِتِّمِئَهٍ', u's':u''},
    u'سبعمئه':{u'i':u'سَبْعمِئَه', u'r':u'سَبْعُمِئَهِ', u'r2':u'سَبْعُمِئَهٍ',
               u'n':u'سَبْعَمِئَهِ', u'n2':u'سَبْعَمِئَهٍ', u'j':u'سَبْعِمِئَهِ',
               u'j2':u'سَبْعِمِئَهٍ', u's':u''},
    u'ثمانمئه':{u'i':u'ثَمَانمِئَه', u'r':u'ثَمَانُمِئَهِ', u'r2':u'ثَمَانُمِئَهٍ',
                u'n':u'ثَمَانَمِئَهِ', u'n2':u'ثَمَانَمِئَهٍ', u'j':u'ثَمَانِمِئَهِ',
                u'j2':u'ثَمَانِمِئَهٍ', u's':u''},
    u'تسعمئه':{u'i':u'تِسْعمِئَه', u'r':u'تِسْعُمِئَهِ', u'r2':u'تِسْعُمِئَهٍ',
               u'n':u'تِسْعَمِئَهِ', u'n2':u'تِسْعَمِئَهٍ', u'j':u'تِسْعِمِئَهِ',
               u'j2':u'تِسْعِمِئَهٍ', u's':u''},
    u'ثلاثمائه':{u'i':u'ثَلَاثمِائَه', u'r':u'ثَلَاثُمِائَهِ', u'r2':u'ثَلَاثُمِائَهٍ',
                 u'n':u'ثَلَاثَمِائَهِ', u'n2':u'ثَلَاثَمِائَهٍ', u'j':u'ثَلَاثِمِائَهِ',
                 u'j2':u'ثَلَاثِمِائَهٍ', u's':u''},
    u'اربعمائه':{u'i':u'اَرْبَعمِائَه', u'r':u'اَرْبَعُمِائَهِ', u'r2':u'اَرْبَعُمِائَهٍ',
                 u'n':u'اَرْبَعَمِائَهِ', u'n2':u'اَرْبَعَمِائَهٍ', u'j':u'اَرْبَعِمِائَهِ',
                 u'j2':u'اَرْبَعِمِائَهٍ', u's':u''},
    u'خمسمائه':{u'i':u'خَمْسمِائَه', u'r':u'خَمْسُمِائَهِ', u'r2':u'خَمْسُمِائَهٍ',
                u'n':u'خَمْسَمِائَهِ', u'n2':u'خَمْسَمِائَهٍ', u'j':u'خَمْسِمِائَهِ',
                u'j2':u'خَمْسِمِائَهٍ', u's':u''},
    u'ستمائه':{u'i':u'سِتّمِائَه', u'r':u'سِتُّمِائَهِ', u'r2':u'سِتُّمِائَهٍ',
               u'n':u'سِتَّمِائَهِ', u'n2':u'سِتَّمِائَهٍ', u'j':u'سِتِّمِائَهِ',
               u'j2':u'سِتِّمِائَهٍ', u's':u''},
    u'سبعمائه':{u'i':u'سَبْعمِائَه', u'r':u'سَبْعُمِائَهِ', u'r2':u'سَبْعُمِائَهٍ',
                u'n':u'سَبْعَمِائَهِ', u'n2':u'سَبْعَمِائَهٍ', u'j':u'سَبْعِمِائَهِ',
                u'j2':u'سَبْعِمِائَهٍ', u's':u''},
    u'ثمانمائه':{u'i':u'ثَمَانمِائَه', u'r':u'ثَمَانُمِائَهِ', u'r2':u'ثَمَانُمِائَهٍ',
                 u'n':u'ثَمَانَمِائَهِ', u'n2':u'ثَمَانَمِائَهٍ', u'j':u'ثَمَانِمِائَهِ',
                 u'j2':u'ثَمَانِمِائَهٍ', u's':u''},
    u'تسعمائه':{u'i':u'تِسْعمِائَه', u'r':u'تِسْعُمِائَهِ', u'r2':u'تِسْعُمِائَهٍ',
                u'n':u'تِسْعَمِائَهِ', u'n2':u'تِسْعَمِائَهٍ', u'j':u'تِسْعِمِائَهِ',
                u'j2':u'تِسْعِمِائَهٍ', u's':u''},
    u'الف':{u'i':u'اَلْف', u'r':u'اَلْف', u'r2':u'اَلْفٌ', u'n':u'اَلْفَ',
            u'n2':u'اَلْفً', u'j':u'اَلْفِ', u'j2':u'اَلْفٍ', u's':u''},
    u'الفا':{u'i':u'اَلْفًا', u'r':u'اَلْفًا', u'r2':u'اَلْفًا', u'n':u'اَلْفًا',
             u'n2':u'اَلْفًا', u'j':u'اَلْفًا', u'j2':u'اَلْفًا', u's':u'اَلْفًا'},
    u'مليون':{u'i':u'مِلْيُون', u'r':u'مِلْيُونُ', u'r2':u'مِلْيُونٌ',
              u'n':u'مِلْيُونَ', u'n2':u'مِلْيُونً', u'j':u'مِلْيُونِ',
              u'j2':u'مِلْيُونٍ', u's':u''},
    u'مليار':{u'i':u'مِلْيَار', u'r':u'مِلْيَارُ', u'r2':u'مِلْيَارٌ',
              u'n':u'مِلْيَارَ', u'n2':u'مِلْيَارً', u'j':u'مِلْيَارِ',
              u'j2':u'مِلْيَارٍ', u's':u''},
    u'الفان':{u'i':u'الْفَانِ', u'r':u'الْفَانِ', u'r2':u'', u'n':u'',
              u'n2':u'', u'j':u'', u'j2':u'', u's':u'*'},
    u'الفين':{u'i':u'الْفَيْنِ', u'r':u'الْفَيْنِ', u'r2':u'', u'n':u'',
              u'n2':u'', u'j':u'', u'j2':u'', u's':u'*'},
    u'مليونان':{u'i':u'مِلْيُونَانِ', u'r':u'مِلْيُونَانِ', u'r2':u'', u'n':u'',
                u'n2':u'', u'j':u'', u'j2':u'', u's':u'*'},
    u'مليونين':{u'i':u'مِلْيُونَيْنِ', u'r':u'مِلْيُونَيْنِ', u'r2':u'', u'n':u'',
                u'n2':u'', u'j':u'', u'j2':u'', u's':u'*'},
    u'ملياران':{u'i':u'مِلْيَارَانِ', u'r':u'مِلْيَارَانِ', u'r2':u'', u'n':u'',
                u'n2':u'', u'j':u'', u'j2':u'', u's':u'*'},
    u'مليارين':{u'i':u'مِلْيَارَيْنِ', u'r':u'مِلْيَارَيْنِ', u'r2':u'', u'n':u'',
                u'n2':u'', u'j':u'', u'j2':u'', u's':u'*'},
    u'احد':{u'i':u'اَحَد', u'r':u'اَحُدُّ', u'r2':u'اَحَدٌ', u'n':u'اَحَدَ',
            u'n2':u'اَحَدً', u'j':u'اَحَدِ', u'j2':u'اَحَدٍ', u's':u''},
    u'احدى':{u'i':u'احْدَى', u'r':u'احْدَى', u'r2':u'احْدَىٌ', u'n':u'احْدَى',
             u'n2':u'احْدًى', u'j':u'احْدَىِ', u'j2':u'احْدَىٍ', u's':u'*'},
    u'اثنين':{u'i':u'اِثْنَينِ', u'r':u'اِثْنَينِ', u'r2':u'', u'n':u'',
              u'n2':u'', u'j':u'', u'j2':u'', u's':u'*'},
    u'اثنين':{u'i':u'اثنين', u'r':u'اثنين', u'r2':u'', u'n':u'',
              u'n2':u'', u'j':u'', u'j2':u'', u's':u'*'},
    u'اثنان':{u'i':u'اثنان', u'r':u'اثنان', u'r2':u'', u'n':u'',
              u'n2':u'', u'j':u'', u'j2':u'', u's':u'*'},
    u'اثني':{u'i':u'اِثْنَيْ', u'r':u'اِثْنَيْ', u'r2':u'', u'n':u'', u'n2':u'',
             u'j':u'', u'j2':u'', u's':u'*'},
    u'اثنا':{u'i':u'اِثْنَا', u'r':u'اثنا', u'r2':u'', u'n':u'', u'n2':u'',
             u'j':u'', u'j2':u'', u's':u'*'},
    u'اثني':{u'i':u'اثني', u'r':u'اثني', u'r2':u'', u'n':u'', u'n2':u'',
             u'j':u'', u'j2':u'', u's':u'*'},
    u'اثنا':{u'i':u'اثنا', u'r':u'اثنا', u'r2':u'', u'n':u'', u'n2':u'',
             u'j':u'', u'j2':u'', u's':u'*'},
    u'ثلاث':{u'i':u'ثَلاث', u'r':u'ثَلاثُ', u'r2':u'ثَلاثٌ', u'n':u'ثَلاثَ',
             u'n2':u'', u'j':u'ثَلاثِ', u'j2':u'ثَلاثٍ', u's':u''},
    u'اربع':{u'i':u'اَرْبَع', u'r':u'اَرْبَعُ', u'r2':u'اَرْبَعٌ', u'n':u'اَرْبَعَ',
             u'n2':u'', u'j':u'اَرْبَعِ', u'j2':u'اَرْبَعٍ', u's':u''},
    u'خمس':{u'i':u'خَمْس', u'r':u'خَمْسُ', u'r2':u'خَمْسٌ', u'n':u'خَمْسَ',
            u'n2':u'', u'j':u'خَمْسِ', u'j2':u'خَمْسٍ', u's':u''},
    u'ست':{u'i':u'سِتّ', u'r':u'سِتُّ', u'r2':u'سِتٌّ', u'n':u'سِتَّ', u'n2':u'',
           u'j':u'سِتِّ', u'j2':u'سِتٍّ', u's':u''},
    u'سبع':{u'i':u'سَبْع', u'r':u'سَبْعُ', u'r2':u'سَبْعٌ', u'n':u'سَبْعَ',
            u'n2':u'', u'j':u'سَبْعِ', u'j2':u'سَبْعٍ', u's':u''},
    u'ثمان':{u'i':u'ثَمَان', u'r':u'ثُمانُ', u'r2':u'ثَمَانٌ', u'n':u'ثَمَانَ',
             u'n2':u'', u'j':u'ثَمَانِ', u'j2':u'ثَمَانٍ', u's':u''},
    u'ثماني':{u'i':u'ثَمانِي', u'r':u'ثَمانِي', u'r2':u'', u'n':u'',
              u'n2':u'', u'j':u'', u'j2':u'', u's':u'*'},
    u'تسع':{u'i':u'تِسْع', u'r':u'تِسْعُ', u'r2':u'تِسْعٌ', u'n':u'تِسْعَ',
            u'n2':u'', u'j':u'تِسْعِ', u'j2':u'تِسْعٍ', u's':u''},
    u'عشر':{u'i':u'عَشْر', u'r':u'عَشْرُ', u'r2':u'عَشْرٌ', u'n':u'عَشَرَ',
            u'n2':u'', u'j':u'عَشْرِ', u'j2':u'عَشْرٍ', u's':u''},
    u'ثلاثا':{u'i':u'ثَلَاثًا', u'r':u'', u'r2':u'', u'n':u'',
              u'n2':u'ثَلَاثًا', u'j':u'', u'j2':u'', u's':u'*'},
    u'اربعا':{u'i':u'اَرْبَعًا', u'r':u'', u'r2':u'', u'n':u'',
              u'n2':u'اَرْبَعًا', u'j':u'', u'j2':u'', u's':u'*'},
    u'خمسا':{u'i':u'خَمْسًا', u'r':u'', u'r2':u'', u'n':u'', u'n2':u'خَمْسًا',
             u'j':u'', u'j2':u'', u's':u'*'},
    u'ستا':{u'i':u'سِتًّا', u'r':u'', u'r2':u'', u'n':u'', u'n2':u'سِتًّا',
            u'j':u'', u'j2':u'', u's':u'*'},
    u'سبعا':{u'i':u'سَبْعًا', u'r':u'', u'r2':u'', u'n':u'', u'n2':u'سَبْعًا',
             u'j':u'', u'j2':u'', u's':u'*'},
    u'تسعا':{u'i':u'تِسْعًا', u'r':u'', u'r2':u'', u'n':u'', u'n2':u'تِسْعًا',
             u'j':u'', u'j2':u'', u's':u'*'},
    u'عشرا':{u'i':u'عَشْرًا', u'r':u'', u'r2':u'', u'n':u'', u'n2':u'عَشْرًا',
             u'j':u'', u'j2':u'', u's':u'*'},
    u'عشرين':{u'i':u'عِشْرِينَ', u'r':u'عِشْرِينَ', u'r2':u'عِشْرِينَ',
              u'n':u'عِشْرِينَ', u'n2':u'عِشْرِينَ', u'j':u'عِشْرِينَ',
              u'j2':u'عِشْرِينَ', u's':u'*'},
    u'ثلاثين':{u'i':u'ثَلَاثِينَ', u'r':u'ثَلَاثِينَ', u'r2':u'ثَلَاثِينَ',
               u'n':u'ثَلَاثِينَ', u'n2':u'ثَلَاثِينَ', u'j':u'ثَلَاثِينَ',
               u'j2':u'ثَلَاثِينَ', u's':u'*'},
    u'اربعين':{u'i':u'اَرْبَعِينَ', u'r':u'اَرْبَعِينَ', u'r2':u'اَرْبَعِينَ',
               u'n':u'اَرْبَعِينَ', u'n2':u'اَرْبَعِينَ', u'j':u'اَرْبَعِينَ',
               u'j2':u'اَرْبَعِينَ', u's':u'*'},
    u'خمسين':{u'i':u'خَمْسِينَ', u'r':u'خَمْسِينَ', u'r2':u'خَمْسِينَ',
              u'n':u'خَمْسِينَ', u'n2':u'خَمْسِينَ', u'j':u'خَمْسِينَ',
              u'j2':u'خَمْسِينَ', u's':u'*'},
    u'ستين':{u'i':u'سِتِّينَ', u'r':u'سِتِّينَ', u'r2':u'سِتِّينَ', u'n':u'سِتِّينَ',
             u'n2':u'سِتِّينَ', u'j':u'سِتِّينَ', u'j2':u'سِتِّينَ', u's':u'*'},
    u'سبعين':{u'i':u'سَبْعِينَ', u'r':u'سَبْعِينَ', u'r2':u'سَبْعِينَ',
              u'n':u'سَبْعِينَ', u'n2':u'سَبْعِينَ', u'j':u'سَبْعِينَ',
              u'j2':u'سَبْعِينَ', u's':u'*'},
    u'ثمانين':{u'i':u'ثَمانِينَ', u'r':u'ثَمانِينَ', u'r2':u'ثَمانِينَ',
               u'n':u'ثَمانِينَ', u'n2':u'ثَمانِينَ', u'j':u'ثَمانِينَ',
               u'j2':u'ثَمانِينَ', u's':u'*'},
    u'تسعين':{u'i':u'تِسْعِينَ', u'r':u'تِسْعِينَ', u'r2':u'تِسْعِينَ',
              u'n':u'تِسْعِينَ', u'n2':u'تِسْعِينَ', u'j':u'تِسْعِينَ',
              u'j2':u'تِسْعِينَ', u's':u'*'},
    u'مائه':{u'i':u'مِائَه', u'r':u'مائه', u'r2':u'مِائَهٌ', u'n':u'مِائَهَ',
             u'n2':u'مِائَهً', u'j':u'مِائَهِ', u'j2':u'مِائَهٍ', u's':u''},
    u'مئتين':{u'i':u'مئتين', u'r':u'مئتين', u'r2':u'', u'n':u'',
              u'n2':u'', u'j':u'', u'j2':u'', u's':u'*'},
    u'الاف':{u'i':u'الاَف', u'r':u'الاَفُ', u'r2':u'الاَفٌ', u'n':u'الاَفَ',
             u'n2':u'', u'j':u'الاَفِ', u'j2':u'الاَفٍ', u's':u''},
    u'ملايين':{u'i':u'مَلاَيِينُ', u'r':u'مَلاَيِينُ', u'r2':u'', u'n':u'',
               u'n2':u'', u'j':u'', u'j2':u'', u's':u'*'},
    u'مليارات':{u'i':u'مِلْيَارَات', u'r':u'مِلْيَارَاتُ', u'r2':u'مِلْيَارَاتٌ',
                u'n':u'مِلْيَارَاتَ', u'n2':u'مِلْيَارَاتً', u'j':u'مِلْيَارَاتِ',
                u'j2':u'مِلْيَارَاتٍ', u's':u''},
}



UNIT_WORDS = {
    # i: invariant vocalization ثابت
    # a: added case مضاف اليه
    # n: mansoub منصوب
    # p: plural: جمع
    u'اذرع': {'i':u'اّذْرُعٍ', 'a':u'', 'n':u'', 'p':u'اّذْرُعٍ', },
    u'ارطال': {'i':u'اَرْطَالٍ', 'a':u'', 'n':u'', 'p':u'اَرْطَالٍ', },
    u'اسابيع': {'i':u'اَسَابِيعَ', 'a':u'', 'n':u'', 'p':u'اَسَابِيعَ', },
    u'اسبوع': {'i':u'اُسْبُوع', 'a':u'اُسْبُوعٍ', 'n':u'', 'p':u'اَسَابِيعَ', },
    u'اسبوعا': {'i':u'اُسْبُوعًا', 'a':u'', 'n':u'', 'p':u'', },
    u'اشبار': {'i':u'اَشْبَارٍ', 'a':u'', 'n':u'', 'p':u'اَشْبَارٍ', },
    u'اشهر': {'i':u'اَشْهُرٍ', 'a':u'', 'n':u'', 'p':u'اَشْهُرٍ', },
    u'اعوام': {'i':u'اَعْوَامٍ', 'a':u'', 'n':u'', 'p':u'اَعْوَامٍ', },
    u'اميال': {'i':u'اَمْيَالٍ', 'a':u'', 'n':u'', 'p':u'اَمْيَالٍ', },
    u'ايام': {'i':u'اَيَّامٍ', 'a':u'', 'n':u'', 'p':u'اَيَّامٍ', },
    u'بوصات': {'i':u'بُوصَاتٍ', 'a':u'', 'n':u'', 'p':u'بُوصَاتٍ', },
    u'بوصه': {'i':u'بُوصَه', 'a':u'بُوصَهٍ', 'n':u'بُوصَهً', 'p':u'بُوصَاتٍ', },
    u'جنيه': {'i':u'جُنَيْه', 'a':u'جُنَيْهٍ', 'n':u'', 'p':u'', },
    u'جنيها': {'i':u'جُنَيْهًا', 'a':u'', 'n':u'جُنَيْهًا', 'p':u'جُنَيْهَات', },
    u'جنيهات': {'i':u'جُنَيْهَات', 'a':u'', 'n':u'', 'p':u'جُنَيْهَات', },
    u'دراهم': {'i':u'دَرَاهِمَ', 'a':u'', 'n':u'', 'p':u'دَرَاهِمَ', },
    u'درجات': {'i':u'دَرَجَاتٍ', 'a':u'', 'n':u'', 'p':u'دَرَجَاتٍ', },
    u'درجه': {'i':u'دَرَجَه', 'a':u'دَرَجَهٍ', 'n':u'دَرَجَهً', 'p':u'دَرَجَاتٍ', },
    u'درهم': {'i':u'دِرْهَم', 'a':u'دِرْهَمٍ', 'n':u'', 'p':u'', },
    u'درهما': {'i':u'دِرْهَمًا', 'a':u'', 'n':u'دِرْهَمًا', 'p':u'دَرَاهِمَ', },
    u'دنانير': {'i':u'دَنَانِيرَ', 'a':u'', 'n':u'', 'p':u'دَنَانِيرَ', },
    u'دولار': {'i':u'دُولَار', 'a':u'دُولَارٍ', 'n':u'', 'p':u'', },
    u'دولارا': {'i':u'دُولَارًا', 'a':u'', 'n':u'دُولَارًا', 'p':u'دُولَارَاتٍ', },
    u'دولارات': {'i':u'دُولَارَاتٍ', 'a':u'', 'n':u'', 'p':u'دُولَارَاتٍ', },
    u'دينار': {'i':u'دِينَار', 'a':u'دِينَارٍ', 'n':u'', 'p':u'', },
    u'دينارا': {'i':u'دِينَارًا', 'a':u'', 'n':u'دِينَارًا', 'p':u'دَنَانِيرَ', },
    u'ذراع': {'i':u'ذِرَاع', 'a':u'ذِرَاعٍ', 'n':u'', 'p':u'', },
    u'ذراعا': {'i':u'ذِرَاعًا', 'a':u'', 'n':u'ذِرَاعًا', 'p':u'اّذْرُعٍ', },
    u'رطل': {'i':u'رِطْل', 'a':u'رِطْلٍ', 'n':u'', 'p':u'', },
    u'رطلا': {'i':u'رِطْلًا', 'a':u'', 'n':u'رِطْلًا', 'p':u'اَرْطَالٍ', },
    u'ريال': {'i':u'رِيَال', 'a':u'رِيَالٍ', 'n':u'', 'p':u'', },
    u'ريالا': {'i':u'رِيَالًا', 'a':u'', 'n':u'رِيَالًا', 'p':u'رِيَالَاتٍ', },
    u'ريالات': {'i':u'رِيَالَاتٍ', 'a':u'', 'n':u'', 'p':u'رِيَالَاتٍ', },
    u'سنه': {'i':u'سَنَه', 'a':u'سَنَهٍ', 'n':u'سَنَهً', 'p':u'سَنَوَاتٍ', },
    u'سنتيم': {'i':u'سَنْتِيم', 'a':u'سَنْتِيمٍ', 'n':u'', 'p':u'', },
    u'سنتيما': {'i':u'سَنْتِيمًا', 'a':u'', 'n':u'سَنْتِيمًا', 'p':u'سَنْتِيماتٍ', },
    u'سنتيمات': {'i':u'سَنْتِيماتٍ', 'a':u'', 'n':u'', 'p':u'سَنْتِيماتٍ', },
    u'سنوات': {'i':u'سَنَوَاتٍ', 'a':u'', 'n':u'', 'p':u'سَنَوَاتٍ', },
    u'شبر': {'i':u'شِبْر', 'a':u'شِبْرٍ', 'n':u'', 'p':u'', },
    u'شبرا': {'i':u'شِبْرًا', 'a':u'', 'n':u'شِبْرًا', 'p':u'اَشْبَارٍ', },
    u'شهر': {'i':u'شَهْر', 'a':u'شَهْرٍ', 'n':u'', 'p':u'', },
    u'شهرا': {'i':u'شَهْرًا', 'a':u'', 'n':u'شَهْرًا', 'p':u'اَشْهُرٍ', },
    u'صفحات': {'i':u'صَفْحَاتٍ', 'a':u'', 'n':u'', 'p':u'صَفْحَاتٍ', },
    u'صفحه': {'i':u'صَفْحَه', 'a':u'صَفْحَهٍ', 'n':u'صَفْحَهً', 'p':u'صَفْحَاتٍ', },
    u'عام': {'i':u'عَام', 'a':u'عَامٍ', 'n':u'', 'p':u'', },
    u'عاما': {'i':u'عَامًا', 'a':u'', 'n':u'عَامًا', 'p':u'اَعْوَامٍ', },
    u'فراسخ': {'i':u'فَرَاسِخَ', 'a':u'', 'n':u'', 'p':u'فَرَاسِخَ', },
    u'فرسخ': {'i':u'فَرْسَخ', 'a':u'فَرْسَخٍ', 'n':u'', 'p':u'', },
    u'فرسخا': {'i':u'فَرْسَخًا', 'a':u'', 'n':u'فَرْسَخًا', 'p':u'فَرَاسِخَ', },
    u'فلس': {'i':u'فِلْس', 'a':u'فِلْسٍ', 'n':u'', 'p':u'', },
    u'فلسا': {'i':u'فِلْسًا', 'a':u'', 'n':u'فِلْسًا', 'p':u'فُلُوسٍ', },
    u'فلوس': {'i':u'فُلُوسٍ', 'a':u'', 'n':u'', 'p':u'فُلُوسٍ', },
    u'قرش': {'i':u'قِرْش', 'a':u'قِرْشٍ', 'n':u'', 'p':u'', },
    u'قرشا': {'i':u'قِرْشًا', 'a':u'', 'n':u'قِرْشًا', 'p':u'قُرُوشٍ', },
    u'قروش': {'i':u'قُرُوشٍ', 'a':u'', 'n':u'', 'p':u'قُرُوشٍ', },
    u'كيلوغرام': {'i':u'كِيلُوغَرَام', 'a':u'كِيلُوغَرَامٍ', 'n':u'', 'p':u'', },
    u'كيلوغراما': {'i':u'كِيلُوغَرَامًا', 'a':u'', 'n':u'كِيلُوغَرَامًا',
                   'p':u'كِيلُوغَرَامَاتٍ', },
    u'كيلوغرامات': {'i':u'كِيلُوغَرَامَاتٍ', 'a':u'', 'n':u'',
                    'p':u'كِيلُوغَرَامَاتٍ', },
    u'كيلومتر': {'i':u'كِيلُومِتْر', 'a':u'كِيلُومِتْرٍ', 'n':u'', 'p':u'', },
    u'كيلومترا': {'i':u'كِيلُومِتْرًا', 'a':u'', 'n':u'كِيلُومِتْرًا',
                  'p':u'كِيلُومِتْرَاتٍ', },
    u'كيلومترات': {'i':u'كِيلُومِتْرَاتٍ', 'a':u'', 'n':u'',
                   'p':u'كِيلُومِتْرَاتٍ', },
    u'لتر': {'i':u'لِتْر', 'a':u'لِتْرٍ', 'n':u'', 'p':u'', },
    u'لترا': {'i':u'لِتْرًا', 'a':u'', 'n':u'لِتْرًا', 'p':u'لِتْرَاتٍ', },
    u'لترات': {'i':u'لِتْرَاتٍ', 'a':u'', 'n':u'', 'p':u'لِتْرَاتٍ', },
    u'ليال': {'i':u'لَيَالٍ', 'a':u'', 'n':u'', 'p':u'لَيَالٍ', },
    u'ليرات': {'i':u'لِيرَاتٍ', 'a':u'', 'n':u'', 'p':u'لِيرَاتٍ', },
    u'ليره': {'i':u'لِيرَه', 'a':u'لِيرَهٍ', 'n':u'لِيرَهً', 'p':u'لِيرَاتٍ', },
    u'ليله': {'i':u'لَيْلَه', 'a':u'لَيْلَهٍ', 'n':u'لَيْلَهً', 'p':u'لَيَالٍ', },
    u'ميل': {'i':u'مِيل', 'a':u'مِيلٍ', 'n':u'', 'p':u'', },
    u'ميلا': {'i':u'مِيلًا', 'a':u'', 'n':u'مِيلًا', 'p':u'اَمْيَالٍ', },
    u'نقاط': {'i':u'نِقَاطٍ', 'a':u'', 'n':u'', 'p':u'نِقَاطٍ', },
    u'نقطه': {'i':u'نُقْطَه', 'a':u'نُقْطَهٍ', 'n':u'نُقْطَهً', 'p':u'نِقَاطٍ', },
    u'هللات': {'i':u'هَلَلَاتٍ', 'a':u'', 'n':u'', 'p':u'هَلَلَاتٍ', },
    u'هلله': {'i':u'هَلَلَه', 'a':u'هَلَلَهٍ', 'n':u'هَلَلَهً', 'p':u'هَلَلَاتٍ', },
    u'يورو': {'i':u'يُورُو', 'a':u'يُورُو', 'n':u'يُورُو', 'p':u'يُورُو', },
    #~ u'يورو': {'i':u'يُورُو', 'a':u'', 'n':u'', 'p':u'يُورُو', },
    u'يوم': {'i':u'يَوْم', 'a':u'يَوْمٍ', 'n':u'', 'p':u'', },
    u'يوما': {'i':u'يَوْمًا', 'a':u'', 'n':u'يَوْمًا', 'p':u'اَيَّامٍ', },
}



INDIVIDUALS = {}
INDIVIDUALS[0] = {}
INDIVIDUALS[1] = {}
INDIVIDUALS[2] = {}
INDIVIDUALS[2][1] = {}
INDIVIDUALS[2][2] = {}
INDIVIDUALS[3] = {}
INDIVIDUALS[4] = {}
INDIVIDUALS[5] = {}
INDIVIDUALS[6] = {}
INDIVIDUALS[7] = {}
INDIVIDUALS[8] = {}
INDIVIDUALS[9] = {}
INDIVIDUALS[10] = {}
INDIVIDUALS[11] = {}
INDIVIDUALS[12] = {}
INDIVIDUALS[12][1] = {}
INDIVIDUALS[12][2] = {}
INDIVIDUALS[13] = {}
INDIVIDUALS[14] = {}
INDIVIDUALS[15] = {}
INDIVIDUALS[16] = {}
INDIVIDUALS[17] = {}
INDIVIDUALS[18] = {}
INDIVIDUALS[19] = {}
INDIVIDUALS[20] = {}
INDIVIDUALS[30] = {}
INDIVIDUALS[40] = {}
INDIVIDUALS[50] = {}
INDIVIDUALS[60] = {}
INDIVIDUALS[70] = {}
INDIVIDUALS[80] = {}
INDIVIDUALS[90] = {}
INDIVIDUALS[100] = {}
INDIVIDUALS[200] = {}
INDIVIDUALS[300] = {}
INDIVIDUALS[400] = {}
INDIVIDUALS[500] = {}
INDIVIDUALS[600] = {}
INDIVIDUALS[700] = {}
INDIVIDUALS[800] = {}
INDIVIDUALS[900] = {}
INDIVIDUALS[1000] = {}
INDIVIDUALS[2000] = {}
INDIVIDUALS[14] = {}
INDIVIDUALS[0][1] = u''
INDIVIDUALS[0][2] = u''
INDIVIDUALS[1][1] = u'واحد'
INDIVIDUALS[1][2] = u'واحده'
INDIVIDUALS[2][1][1] = u'اثنان'
INDIVIDUALS[2][1][2] = u'اثنين'
INDIVIDUALS[2][2][1] = u'اثنتان'
INDIVIDUALS[2][2][2] = u'اثنتين'

INDIVIDUALS[3][1] = u'ثلاث'
INDIVIDUALS[4][1] = u'اربع'
INDIVIDUALS[5][1] = u'خمس'
INDIVIDUALS[6][1] = u'ست'
INDIVIDUALS[7][1] = u'سبع'
INDIVIDUALS[8][1] = u'ثماني'
INDIVIDUALS[9][1] = u'تسع'
INDIVIDUALS[10][1] = u'عشر'
INDIVIDUALS[3][2] = u'ثلاثه'
INDIVIDUALS[4][2] = u'اربعه'
INDIVIDUALS[5][2] = u'خمسه'
INDIVIDUALS[6][2] = u'سته'
INDIVIDUALS[7][2] = u'سبعه'
INDIVIDUALS[8][2] = u'ثمانيه'
INDIVIDUALS[9][2] = u'تسعه'
INDIVIDUALS[10][2] = u'عشره'

INDIVIDUALS[11][1] = u'احد عشر'
INDIVIDUALS[11][2] = u'احدى عشره'

INDIVIDUALS[12][1][1] = u'اثنا عشر'
INDIVIDUALS[12][1][2] = u'اثني عشر'
INDIVIDUALS[12][2][1] = u'اثنتا عشره'
INDIVIDUALS[12][2][2] = u'اثنتي عشره'

INDIVIDUALS[13][1] = u'ثلاث عشره'
INDIVIDUALS[14][1] = u'اربع عشره'
INDIVIDUALS[15][1] = u'خمس عشره'
INDIVIDUALS[16][1] = u'ست عشره'
INDIVIDUALS[17][1] = u'سبع عشره'
INDIVIDUALS[18][1] = u'ثماني عشره'
INDIVIDUALS[19][1] = u'تسع عشره'
INDIVIDUALS[13][2] = u'ثلاثه عشر'
INDIVIDUALS[14][2] = u'اربعه عشر'
INDIVIDUALS[15][2] = u'خمسه عشر'
INDIVIDUALS[16][2] = u'سته عشر'
INDIVIDUALS[17][2] = u'سبعه عشر'
INDIVIDUALS[18][2] = u'ثمانيه عشر'
INDIVIDUALS[19][2] = u'تسعه عشر'

INDIVIDUALS[20][1] = u'عشرون'
INDIVIDUALS[30][1] = u'ثلاثون'
INDIVIDUALS[40][1] = u'اربعون'
INDIVIDUALS[50][1] = u'خمسون'
INDIVIDUALS[60][1] = u'ستون'
INDIVIDUALS[70][1] = u'سبعون'
INDIVIDUALS[80][1] = u'ثمانون'
INDIVIDUALS[90][1] = u'تسعون'
INDIVIDUALS[20][2] = u'عشرين'
INDIVIDUALS[30][2] = u'ثلاثين'
INDIVIDUALS[40][2] = u'اربعين'
INDIVIDUALS[50][2] = u'خمسين'
INDIVIDUALS[60][2] = u'ستين'
INDIVIDUALS[70][2] = u'سبعين'
INDIVIDUALS[80][2] = u'ثمانين'
INDIVIDUALS[90][2] = u'تسعين'

INDIVIDUALS[200][1] = u'مئتان'
INDIVIDUALS[200][2] = u'مئتين'

INDIVIDUALS[100] = u'مئه'
INDIVIDUALS[300] = u'ثلاثمئه'
INDIVIDUALS[400] = u'اربعمئه'
INDIVIDUALS[500] = u'خمسمئه'
INDIVIDUALS[600] = u'ستمئه'
INDIVIDUALS[700] = u'سبعمئه'
INDIVIDUALS[800] = u'ثمانمئه'
INDIVIDUALS[900] = u'تسعمئه'
COMPLICATIONS = {1:{}, 2:{}, 3:{}}
COMPLICATIONS[1][1] = u'الفان'
COMPLICATIONS[1][2] = u'الفين'
COMPLICATIONS[1][3] = u'الاف'
COMPLICATIONS[1][4] = u'الف'

COMPLICATIONS[2][1] = u'مليونان'
COMPLICATIONS[2][2] = u'مليونين'
COMPLICATIONS[2][3] = u'ملايين'
COMPLICATIONS[2][4] = u'مليون'

COMPLICATIONS[3][1] = u'ملياران'
COMPLICATIONS[3][2] = u'مليارين'
COMPLICATIONS[3][3] = u'مليارات'
COMPLICATIONS[3][4] = u'مليار'
